; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v5 - type_1 ?v3 - type_3)
 	      (pred_1 ?v2 - object ?v3 - type_3)
	      (pred_2 ?v5 - type_1 ?v7 - type_2)
	      (pred_4 ?v5 - type_1 ?v2 - object ?v7 - type_2))

   (:action op_1
       :parameters  (?v5 - type_1 ?v6 ?v8 - type_3)
       :precondition (and  (pred_3 ?v5 ?v6))
       :effect (and  (pred_3 ?v5 ?v8)
		     (not (pred_3 ?v5 ?v6))))

   (:action op_2
       :parameters (?v5 - type_1 ?v1 - object ?v4 - type_3 ?v7 - type_2)
       :precondition  (and  (pred_1 ?v1 ?v4) (pred_3 ?v5 ?v4) (pred_2 ?v5 ?v7))
       :effect (and (pred_4 ?v5 ?v1 ?v7)
		    (not (pred_1 ?v1 ?v4)) 
		    (not (pred_2 ?v5 ?v7))))

   (:action op_3
       :parameters (?v5 - type_1 ?v1 - object ?v4 - type_3 ?v7 - type_2)
       :precondition  (and  (pred_4 ?v5 ?v1 ?v7) (pred_3 ?v5 ?v4))
       :effect (and (pred_1 ?v1 ?v4)
		    (pred_2 ?v5 ?v7)
		    (not (pred_4 ?v5 ?v1 ?v7)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_05 - type_1
obj_10 obj_09 - type_2
obj_08 obj_01 obj_03 obj_06 - type_3
obj_07 obj_04 obj_02 - object)
(:init
(pred_3 obj_05 obj_01)
(pred_2 obj_05 obj_10)
(pred_2 obj_05 obj_09)
(pred_1 obj_07 obj_08)
(pred_1 obj_04 obj_06)
(pred_1 obj_02 obj_08)
)
(:goal
(and
(pred_1 obj_07 obj_06)
(pred_1 obj_04 obj_08)
(pred_1 obj_02 obj_01)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_05 ?b obj_09))))
)
)

; plan
1. (op_1 obj_05 obj_01 obj_08)
   deleted: (pred_3 obj_05 obj_01)
   added: (pred_3 obj_05 obj_08)
   goals met: 0 of 3
2. (op_2 obj_05 obj_07 obj_08 obj_10)
   deleted: (pred_1 obj_07 obj_08) (pred_2 obj_05 obj_10)
   added: (pred_4 obj_05 obj_07 obj_10)
   goals met: 0 of 3
3. (op_1 obj_05 obj_08 obj_06)
   deleted: (pred_3 obj_05 obj_08)
   added: (pred_3 obj_05 obj_06)
   goals met: 0 of 3
4. (op_3 obj_05 obj_07 obj_06 obj_10)
   deleted: (pred_4 obj_05 obj_07 obj_10)
   added: (pred_1 obj_07 obj_06) (pred_2 obj_05 obj_10)
   goals met: 1 of 3
5. (op_2 obj_05 obj_04 obj_06 obj_10)
   deleted: (pred_1 obj_04 obj_06) (pred_2 obj_05 obj_10)
   added: (pred_4 obj_05 obj_04 obj_10)
   goals met: 1 of 3
6. (op_1 obj_05 obj_06 obj_08)
   deleted: (pred_3 obj_05 obj_06)
   added: (pred_3 obj_05 obj_08)
   goals met: 1 of 3
7. (op_3 obj_05 obj_04 obj_08 obj_10)
   deleted: (pred_4 obj_05 obj_04 obj_10)
   added: (pred_1 obj_04 obj_08) (pred_2 obj_05 obj_10)
   goals met: 2 of 3
8. (op_2 obj_05 obj_02 obj_08 obj_10)
   deleted: (pred_1 obj_02 obj_08) (pred_2 obj_05 obj_10)
   added: (pred_4 obj_05 obj_02 obj_10)
   goals met: 2 of 3
9. (op_1 obj_05 obj_08 obj_01)
   deleted: (pred_3 obj_05 obj_08)
   added: (pred_3 obj_05 obj_01)
   goals met: 2 of 3
10. (op_3 obj_05 obj_02 obj_01 obj_10)
   deleted: (pred_4 obj_05 obj_02 obj_10)
   added: (pred_1 obj_02 obj_01) (pred_2 obj_05 obj_10)
   goals met: 3 of 3
